<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"aed1c14a335ae0ec3c264e3deaecd755afe85535f115d5794aea04878214ea87","plan_job_ref":"Job terraform plan #124 at https://github.com/suzutan/infra/actions/runs/16689373025","plan_out_hash":"341c90262cfb80ad31839704f1ce0b4a9701e2fa776ca544c1521e37155538a6","plan_hash":"d667454486081f0839a81d559e898fde9f865a6a9bc401f62ea679aaabcd669c","plan_text_format":"diff","version":"2.2.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 9 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.k8s_ingress["argocd.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "argocd.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["asf.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "asf.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["echoserver.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "echoserver.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["grafana.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "grafana.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["grathnode.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "grathnode.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["influxdb2.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "influxdb2.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["navidrome-filebrowser.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "navidrome-filebrowser.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["navidrome.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "navidrome.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_dns_record.k8s_ingress["prometheus.harvestasya.org"] will be created
+   resource "cloudflare_dns_record" "k8s_ingress" {
+       comment_modified_on = (known after apply)
+       content             = "36d574cb-f554-4320-a995-61af899df181.cfargotunnel.com"
+       created_on          = (known after apply)
+       id                  = (known after apply)
+       meta                = (known after apply)
+       modified_on         = (known after apply)
+       name                = "prometheus.harvestasya.org"
+       proxiable           = (known after apply)
+       proxied             = true
+       settings            = (known after apply)
+       tags                = (known after apply)
+       tags_modified_on    = (known after apply)
+       ttl                 = 1
+       type                = "CNAME"
+       zone_id             = "********************************"
    }

  # cloudflare_zero_trust_tunnel_cloudflared_config.k8s_ingress will be updated in-place
!~  resource "cloudflare_zero_trust_tunnel_cloudflared_config" "k8s_ingress" {
!~      config     = {
!~          ingress      = [
!~              {
+                   hostname       = "argocd.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "argocd.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "argocd.harvestasya.org"
                    }
!~                  service        = "http_status:404" -> "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "echoserver.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "echoserver.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "echoserver.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "grathnode.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "grathnode.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "grathnode.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "asf.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "asf.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "asf.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "navidrome.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "navidrome.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "navidrome.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "navidrome-filebrowser.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "navidrome-filebrowser.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "navidrome-filebrowser.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "influxdb2.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "influxdb2.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "influxdb2.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "grafana.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "grafana.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "grafana.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   hostname       = "prometheus.harvestasya.org"
+                   origin_request = {
+                       http_host_header   = "prometheus.harvestasya.org"
+                       no_tls_verify      = true
+                       origin_server_name = "prometheus.harvestasya.org"
                    }
+                   service        = "https://traefik.traefik.svc.cluster.local"
                },
+               {
+                   service = "http_status:404"
                },
            ]
!~          warp_routing = {
!~              enabled = false -> (known after apply)
            } -> (known after apply)
        }
!~      created_at = "2025-08-02T02:24:36Z" -> (known after apply)
        id         = "36d574cb-f554-4320-a995-61af899df181"
!~      source     = "cloudflare" -> (known after apply)
!~      version    = 9 -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #124](https://github.com/suzutan/infra/actions/runs/16689373025)